7767517
225 271
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 3 in0 1 2 3
Convolution              convrelu_0               1 1 3 4 0=16 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 9=2
Convolution              convrelu_1               1 1 4 5 0=32 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=2
Split                    splitncnn_1              1 3 5 6 7 8
Convolution              conv_5                   1 1 8 9 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_6                   1 1 7 10 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_7                   1 1 6 11 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Concat                   cat_0                    3 1 9 10 11 12 0=0
Split                    splitncnn_2              1 4 12 13 14 15 16
Reduction                mean_160                 1 1 16 17 0=3 1=0 -23303=1,0 4=1 5=1
Reduction                max_159                  1 1 15 18 0=4 1=0 -23303=1,0 4=1 5=1
Concat                   cat_1                    2 1 17 18 19 0=0
Split                    splitncnn_3              1 2 19 20 21
Convolution              convsigmoid_8            1 1 21 22 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=18 9=4
BinaryOp                 mul_0                    2 1 22 13 23 0=2
Convolution              convsigmoid_9            1 1 20 24 0=1 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=50 9=4
BinaryOp                 mul_1                    2 1 24 14 25 0=2
Concat                   cat_2                    2 1 23 25 26 0=0
Convolution              convrelu_2               1 1 26 27 0=96 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=165888 9=2
Convolution              convrelu_3               1 1 27 28 0=32 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Convolution              conv_12                  1 1 28 29 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864
Convolution              conv_13                  1 1 2 30 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              convrelu_4               1 1 1 31 0=3 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9 9=2
Convolution              convrelu_5               1 1 31 32 0=32 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=2
BinaryOp                 add_2                    2 1 30 32 33 0=0
Split                    splitncnn_4              1 2 33 34 35
Pooling                  gap_2                    1 1 35 36 0=1 4=1
Reshape                  reshape_148              1 1 36 37 0=32
InnerProduct             fcrelu_0                 1 1 37 38 0=2 1=0 2=64 9=1
InnerProduct             fcsigmoid_1              1 1 38 39 0=32 1=0 2=64 9=4
Reshape                  reshape_149              1 1 39 40 0=1 1=1 2=32
BinaryOp                 mul_3                    2 1 34 40 41 0=2
Split                    splitncnn_5              1 2 41 42 43
Convolution              conv_16                  1 1 43 44 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              convrelu_6               1 1 42 45 0=32 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=2
Convolution              convrelu_7               1 1 45 46 0=3 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=2
BinaryOp                 add_4                    2 1 44 46 47 0=0
BinaryOp                 add_5                    2 1 29 47 48 0=0
Convolution              conv_19                  1 1 48 49 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_95                  1 1 49 50
Convolution              conv_20                  1 1 50 51 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Swish                    silu_96                  1 1 51 52
Slice                    split_0                  1 2 52 53 54 -23300=2,8,8 1=0
Split                    splitncnn_6              1 3 54 55 56 57
Convolution              conv_21                  1 1 57 58 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576
Swish                    silu_97                  1 1 58 59
Convolution              conv_22                  1 1 59 60 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576
Swish                    silu_98                  1 1 60 61
BinaryOp                 add_6                    2 1 56 61 62 0=0
Concat                   cat_3                    3 1 53 55 62 63 0=0
Convolution              conv_23                  1 1 63 64 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Swish                    silu_99                  1 1 64 65
Convolution              conv_24                  1 1 65 66 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_100                 1 1 66 67
Convolution              conv_25                  1 1 67 68 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_101                 1 1 68 69
Slice                    split_1                  1 2 69 70 71 -23300=2,16,16 1=0
Split                    splitncnn_7              1 3 71 72 73 74
Convolution              conv_26                  1 1 74 75 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_102                 1 1 75 76
Convolution              conv_27                  1 1 76 77 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_103                 1 1 77 78
BinaryOp                 add_7                    2 1 73 78 79 0=0
Concat                   cat_4                    3 1 70 72 79 80 0=0
Convolution              conv_28                  1 1 80 81 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_104                 1 1 81 82
Split                    splitncnn_8              1 2 82 83 84
Convolution              conv_29                  1 1 84 85 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_105                 1 1 85 86
Convolution              conv_30                  1 1 86 87 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_106                 1 1 87 88
Slice                    split_2                  1 2 88 89 90 -23300=2,32,32 1=0
Split                    splitncnn_9              1 3 90 91 92 93
Convolution              conv_31                  1 1 93 94 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_107                 1 1 94 95
Convolution              conv_32                  1 1 95 96 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_108                 1 1 96 97
BinaryOp                 add_8                    2 1 92 97 98 0=0
Concat                   cat_5                    3 1 89 91 98 99 0=0
Convolution              conv_33                  1 1 99 100 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_109                 1 1 100 101
Split                    splitncnn_10             1 2 101 102 103
Convolution              conv_34                  1 1 103 104 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_110                 1 1 104 105
Convolution              conv_35                  1 1 105 106 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_111                 1 1 106 107
Slice                    split_3                  1 2 107 108 109 -23300=2,64,64 1=0
Split                    splitncnn_11             1 3 109 110 111 112
Convolution              conv_36                  1 1 112 113 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_112                 1 1 113 114
Convolution              conv_37                  1 1 114 115 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_113                 1 1 115 116
BinaryOp                 add_9                    2 1 111 116 117 0=0
Concat                   cat_6                    3 1 108 110 117 118 0=0
Convolution              conv_38                  1 1 118 119 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_114                 1 1 119 120
Convolution              conv_39                  1 1 120 121 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Split                    splitncnn_12             1 2 121 122 123
Pooling                  maxpool2d_88             1 1 123 124 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_13             1 2 124 125 126
Pooling                  maxpool2d_89             1 1 126 127 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_14             1 2 127 128 129
Pooling                  maxpool2d_90             1 1 129 130 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_7                    4 1 122 125 128 130 131 0=0
Convolution              conv_40                  1 1 131 132 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_115                 1 1 132 133
Split                    splitncnn_15             1 2 133 134 135
Interp                   upsample_146             1 1 135 136 0=1 1=2.0 2=2.0 6=0
Concat                   cat_8                    2 1 136 102 137 0=0
Convolution              conv_41                  1 1 137 138 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_116                 1 1 138 139
Slice                    split_4                  1 2 139 140 141 -23300=2,32,32 1=0
Split                    splitncnn_16             1 2 141 142 143
Convolution              conv_42                  1 1 143 144 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_117                 1 1 144 145
Convolution              conv_43                  1 1 145 146 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_118                 1 1 146 147
Concat                   cat_9                    3 1 140 142 147 148 0=0
Convolution              conv_44                  1 1 148 149 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_119                 1 1 149 150
Split                    splitncnn_17             1 2 150 151 152
Interp                   upsample_147             1 1 152 153 0=1 1=2.0 2=2.0 6=0
Concat                   cat_10                   2 1 153 83 154 0=0
Convolution              conv_45                  1 1 154 155 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_120                 1 1 155 156
Slice                    split_5                  1 2 156 157 158 -23300=2,16,16 1=0
Split                    splitncnn_18             1 2 158 159 160
Convolution              conv_46                  1 1 160 161 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_121                 1 1 161 162
Convolution              conv_47                  1 1 162 163 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_122                 1 1 163 164
Concat                   cat_11                   3 1 157 159 164 165 0=0
Convolution              conv_48                  1 1 165 166 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_123                 1 1 166 167
Split                    splitncnn_19             1 3 167 168 169 170
Convolution              conv_49                  1 1 170 171 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216
Swish                    silu_124                 1 1 171 172
Concat                   cat_12                   2 1 172 151 173 0=0
Convolution              conv_50                  1 1 173 174 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_125                 1 1 174 175
Slice                    split_6                  1 2 175 176 177 -23300=2,32,32 1=0
Split                    splitncnn_20             1 2 177 178 179
Convolution              conv_51                  1 1 179 180 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_126                 1 1 180 181
Convolution              conv_52                  1 1 181 182 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_127                 1 1 182 183
Concat                   cat_13                   3 1 176 178 183 184 0=0
Convolution              conv_53                  1 1 184 185 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_128                 1 1 185 186
Split                    splitncnn_21             1 3 186 187 188 189
Convolution              conv_54                  1 1 189 190 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_129                 1 1 190 191
Concat                   cat_14                   2 1 191 134 192 0=0
Convolution              conv_55                  1 1 192 193 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_130                 1 1 193 194
Slice                    split_7                  1 2 194 195 196 -23300=2,64,64 1=0
Split                    splitncnn_22             1 2 196 197 198
Convolution              conv_56                  1 1 198 199 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_131                 1 1 199 200
Convolution              conv_57                  1 1 200 201 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_132                 1 1 201 202
Concat                   cat_15                   3 1 195 197 202 203 0=0
Convolution              conv_58                  1 1 203 204 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_133                 1 1 204 205
Split                    splitncnn_23             1 2 205 206 207
MemoryData               pnnx_149                 0 1 208 0=33600
Convolution              conv_59                  1 1 169 209 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_134                 1 1 209 210
Convolution              conv_60                  1 1 210 211 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_135                 1 1 211 212
Convolution              conv_61                  1 1 212 213 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_150              1 1 213 214 0=25600 1=64
Convolution              conv_62                  1 1 188 215 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_136                 1 1 215 216
Convolution              conv_63                  1 1 216 217 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_137                 1 1 217 218
Convolution              conv_64                  1 1 218 219 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_151              1 1 219 220 0=6400 1=64
Convolution              conv_65                  1 1 207 221 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_138                 1 1 221 222
Convolution              conv_66                  1 1 222 223 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_139                 1 1 223 224
Convolution              conv_67                  1 1 224 225 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_152              1 1 225 226 0=1600 1=64
Concat                   cat_16                   3 1 214 220 226 227 0=1
Convolution              conv_68                  1 1 168 228 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_140                 1 1 228 229
Convolution              conv_69                  1 1 229 230 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_141                 1 1 230 231
Convolution              conv_70                  1 1 231 232 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=224
Reshape                  reshape_153              1 1 232 233 0=25600 1=7
Convolution              conv_71                  1 1 187 234 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_142                 1 1 234 235
Convolution              conv_72                  1 1 235 236 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_143                 1 1 236 237
Convolution              conv_73                  1 1 237 238 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=224
Reshape                  reshape_154              1 1 238 239 0=6400 1=7
Convolution              conv_74                  1 1 206 240 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_144                 1 1 240 241
Convolution              conv_75                  1 1 241 242 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_145                 1 1 242 243
Convolution              conv_76                  1 1 243 244 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=224
Reshape                  reshape_155              1 1 244 245 0=1600 1=7
Concat                   cat_17                   3 1 233 239 245 246 0=1
Reshape                  reshape_156              1 1 227 247 0=33600 1=16 2=4
Permute                  transpose_161            1 1 247 248 0=2
Softmax                  softmax_1                1 1 248 249 0=0 1=1
Convolution              conv_77                  1 1 249 250 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_157              1 1 250 251 0=33600 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 252 0=33600 1=2
Split                    splitncnn_0              1 2 252 253 254
Slice                    chunk_0                  1 2 251 255 256 -23300=2,-233,-233 1=0
BinaryOp                 sub_10                   2 1 253 255 257 0=1
Split                    splitncnn_24             1 2 257 258 259
BinaryOp                 add_11                   2 1 254 256 260 0=0
Split                    splitncnn_25             1 2 260 261 262
BinaryOp                 add_12                   2 1 258 261 263 0=0
BinaryOp                 div_13                   1 1 263 264 0=3 1=1 2=2.0
BinaryOp                 sub_14                   2 1 262 259 265 0=1
Concat                   cat_18                   2 1 264 265 266 0=0
Reshape                  reshape_158              1 1 208 267 0=33600 1=1
BinaryOp                 mul_15                   2 1 266 267 268 0=2
Sigmoid                  sigmoid_0                1 1 246 269
Concat                   cat_19                   2 1 268 269 out0 0=0
