7767517
217 257
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_77                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_78                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_4                   1 1 6 7 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_79                  1 1 7 8
Convolution              conv_5                   1 1 5 9 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_80                  1 1 9 10
Split                    splitncnn_1              1 3 10 11 12 13
Convolution              conv_6                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_81                  1 1 14 15
Convolution              conv_7                   1 1 15 16 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_82                  1 1 16 17
BinaryOp                 add_0                    2 1 12 17 18 0=0
Concat                   cat_0                    3 1 8 11 18 19 0=0
Convolution              conv_8                   1 1 19 20 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_83                  1 1 20 21
Convolution              conv_9                   1 1 21 22 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_84                  1 1 22 23
Split                    splitncnn_2              1 2 23 24 25
Convolution              conv_10                  1 1 25 26 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_85                  1 1 26 27
Convolution              conv_11                  1 1 24 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_86                  1 1 28 29
Split                    splitncnn_3              1 3 29 30 31 32
Convolution              conv_12                  1 1 32 33 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_87                  1 1 33 34
Convolution              conv_13                  1 1 34 35 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_88                  1 1 35 36
BinaryOp                 add_1                    2 1 31 36 37 0=0
Split                    splitncnn_4              1 3 37 38 39 40
Convolution              conv_14                  1 1 40 41 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_89                  1 1 41 42
Convolution              conv_15                  1 1 42 43 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_90                  1 1 43 44
BinaryOp                 add_2                    2 1 39 44 45 0=0
Concat                   cat_1                    4 1 27 30 38 45 46 0=0
Convolution              conv_16                  1 1 46 47 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_91                  1 1 47 48
Split                    splitncnn_5              1 2 48 49 50
Convolution              conv_17                  1 1 50 51 0=120 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=69120
Swish                    silu_92                  1 1 51 52
Split                    splitncnn_6              1 2 52 53 54
Convolution              conv_18                  1 1 54 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_93                  1 1 55 56
Convolution              conv_19                  1 1 53 57 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_94                  1 1 57 58
Split                    splitncnn_7              1 3 58 59 60 61
Convolution              conv_20                  1 1 61 62 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_95                  1 1 62 63
Convolution              conv_21                  1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_96                  1 1 64 65
BinaryOp                 add_3                    2 1 60 65 66 0=0
Split                    splitncnn_8              1 3 66 67 68 69
Convolution              conv_22                  1 1 69 70 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 70 71
Convolution              conv_23                  1 1 71 72 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_98                  1 1 72 73
BinaryOp                 add_4                    2 1 68 73 74 0=0
Concat                   cat_2                    4 1 56 59 67 74 75 0=0
Convolution              conv_24                  1 1 75 76 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_99                  1 1 76 77
Split                    splitncnn_9              1 2 77 78 79
Convolution              conv_25                  1 1 79 80 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184
Swish                    silu_100                 1 1 80 81
Split                    splitncnn_10             1 2 81 82 83
Convolution              conv_26                  1 1 83 84 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_101                 1 1 84 85
Convolution              conv_27                  1 1 82 86 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=19968
Swish                    silu_102                 1 1 86 87
Split                    splitncnn_11             1 3 87 88 89 90
Convolution              conv_28                  1 1 90 91 0=112 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=104832
Swish                    silu_103                 1 1 91 92
Convolution              conv_29                  1 1 92 93 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=104832
Swish                    silu_104                 1 1 93 94
BinaryOp                 add_5                    2 1 89 94 95 0=0
Concat                   cat_3                    3 1 85 88 95 96 0=0
Convolution              conv_30                  1 1 96 97 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=58368
Swish                    silu_105                 1 1 97 98
Convolution              conv_31                  1 1 98 99 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Split                    splitncnn_12             1 2 99 100 101
Pooling                  maxpool2d_74             1 1 101 102 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_13             1 2 102 103 104
Pooling                  maxpool2d_75             1 1 104 105 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_14             1 2 105 106 107
Pooling                  maxpool2d_76             1 1 107 108 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 100 103 106 108 109 0=0
Convolution              conv_32                  1 1 109 110 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_106                 1 1 110 111
Split                    splitncnn_15             1 2 111 112 113
Interp                   upsample_141             1 1 113 114 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 114 78 115 0=0
Split                    splitncnn_16             1 2 115 116 117
Convolution              conv_33                  1 1 117 118 0=56 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=17920
Swish                    silu_107                 1 1 118 119
Convolution              conv_34                  1 1 116 120 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20480
Swish                    silu_108                 1 1 120 121
Split                    splitncnn_17             1 2 121 122 123
Convolution              conv_35                  1 1 123 124 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 124 125
Convolution              conv_36                  1 1 125 126 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 126 127
Concat                   cat_6                    3 1 119 122 127 128 0=0
Convolution              conv_37                  1 1 128 129 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=23552
Swish                    silu_111                 1 1 129 130
Split                    splitncnn_18             1 2 130 131 132
Interp                   upsample_142             1 1 132 133 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 133 49 134 0=0
Split                    splitncnn_19             1 2 134 135 136
Convolution              conv_38                  1 1 136 137 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_112                 1 1 137 138
Convolution              conv_39                  1 1 135 139 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_113                 1 1 139 140
Split                    splitncnn_20             1 2 140 141 142
Convolution              conv_40                  1 1 142 143 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_114                 1 1 143 144
Convolution              conv_41                  1 1 144 145 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_115                 1 1 145 146
Concat                   cat_8                    3 1 138 141 146 147 0=0
Convolution              conv_42                  1 1 147 148 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_116                 1 1 148 149
Split                    splitncnn_21             1 3 149 150 151 152
Convolution              conv_43                  1 1 152 153 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_117                 1 1 153 154
Concat                   cat_9                    2 1 154 131 155 0=0
Split                    splitncnn_22             1 2 155 156 157
Convolution              conv_44                  1 1 157 158 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_118                 1 1 158 159
Convolution              conv_45                  1 1 156 160 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_119                 1 1 160 161
Split                    splitncnn_23             1 2 161 162 163
Convolution              conv_46                  1 1 163 164 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_120                 1 1 164 165
Convolution              conv_47                  1 1 165 166 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_121                 1 1 166 167
Concat                   cat_10                   3 1 159 162 167 168 0=0
Convolution              conv_48                  1 1 168 169 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16640
Swish                    silu_122                 1 1 169 170
Split                    splitncnn_24             1 3 170 171 172 173
Convolution              conv_49                  1 1 173 174 0=80 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=74880
Swish                    silu_123                 1 1 174 175
Concat                   cat_11                   2 1 175 112 176 0=0
Split                    splitncnn_25             1 2 176 177 178
Convolution              conv_50                  1 1 178 179 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26112
Swish                    silu_124                 1 1 179 180
Convolution              conv_51                  1 1 177 181 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2176
Swish                    silu_125                 1 1 181 182
Split                    splitncnn_26             1 2 182 183 184
Convolution              conv_52                  1 1 184 185 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6336
Swish                    silu_126                 1 1 185 186
Convolution              conv_53                  1 1 186 187 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=44352
Swish                    silu_127                 1 1 187 188
Concat                   cat_12                   3 1 180 183 188 189 0=0
Convolution              conv_54                  1 1 189 190 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_128                 1 1 190 191
Split                    splitncnn_27             1 2 191 192 193
MemoryData               pnnx_52                  0 1 194 0=8400
Convolution              conv_55                  1 1 151 195 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_129                 1 1 195 196
Convolution              conv_56                  1 1 196 197 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648
Swish                    silu_130                 1 1 197 198
Convolution              conv_57                  1 1 198 199 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Reshape                  reshape_143              1 1 199 200 0=6400 1=64
Convolution              conv_58                  1 1 172 201 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=59904
Swish                    silu_131                 1 1 201 202
Convolution              conv_59                  1 1 202 203 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32256
Swish                    silu_132                 1 1 203 204
Convolution              conv_60                  1 1 204 205 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3584
Reshape                  reshape_144              1 1 205 206 0=1600 1=64
Convolution              conv_61                  1 1 193 207 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24192
Swish                    silu_133                 1 1 207 208
Convolution              conv_62                  1 1 208 209 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=28224
Swish                    silu_134                 1 1 209 210
Convolution              conv_63                  1 1 210 211 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3584
Reshape                  reshape_145              1 1 211 212 0=400 1=64
Concat                   cat_13                   3 1 200 206 212 213 0=1
Convolution              conv_64                  1 1 150 214 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_135                 1 1 214 215
Convolution              conv_65                  1 1 215 216 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648
Swish                    silu_136                 1 1 216 217
Convolution              conv_66                  1 1 217 218 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=336
Reshape                  reshape_146              1 1 218 219 0=6400 1=7
Convolution              conv_67                  1 1 171 220 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=52416
Swish                    silu_137                 1 1 220 221
Convolution              conv_68                  1 1 221 222 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20160
Swish                    silu_138                 1 1 222 223
Convolution              conv_69                  1 1 223 224 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=280
Reshape                  reshape_147              1 1 224 225 0=1600 1=7
Convolution              conv_70                  1 1 192 226 0=56 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24192
Swish                    silu_139                 1 1 226 227
Convolution              conv_71                  1 1 227 228 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20160
Swish                    silu_140                 1 1 228 229
Convolution              conv_72                  1 1 229 230 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=280
Reshape                  reshape_148              1 1 230 231 0=400 1=7
Concat                   cat_14                   3 1 219 225 231 232 0=1
Reshape                  reshape_149              1 1 213 233 0=8400 1=16 2=4
Permute                  transpose_152            1 1 233 234 0=2
Softmax                  softmax_1                1 1 234 235 0=0 1=1
Convolution              conv_73                  1 1 235 236 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_150              1 1 236 237 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 238 0=8400 1=2
Split                    splitncnn_0              1 2 238 239 240
Slice                    chunk_0                  1 2 237 241 242 -23300=2,-233,-233 1=0
BinaryOp                 sub_6                    2 1 239 241 243 0=1
Split                    splitncnn_28             1 2 243 244 245
BinaryOp                 add_7                    2 1 240 242 246 0=0
Split                    splitncnn_29             1 2 246 247 248
BinaryOp                 add_8                    2 1 244 247 249 0=0
BinaryOp                 div_9                    1 1 249 250 0=3 1=1 2=2.0
BinaryOp                 sub_10                   2 1 248 245 251 0=1
Concat                   cat_15                   2 1 250 251 252 0=0
Reshape                  reshape_151              1 1 194 253 0=8400 1=1
BinaryOp                 mul_11                   2 1 252 253 254 0=2
Sigmoid                  sigmoid_0                1 1 232 255
Concat                   cat_16                   2 1 254 255 out0 0=0
